; domain
(define (domain blocksworld_domain)
   (:requirements :negative-preconditions :typing)
   (:types
      Boolean - root
      block - root
      root - object
   )
   (:constants
   )
   (:predicates
      (Holding ?block1 - block)
      (On ?block1 - block ?block2 - block)
      (OnGround ?block1 - block)
      (TopClear ?block1 - block)
   )
   (:functions
   )
   (:action pick-up-from-block
      :parameters (?block1 - block ?block2 - block)
      :precondition (and
         (On ?block1 ?block2)
         (TopClear ?block1)
         (forall (?block3 - block)
            (not
               (Holding ?block3)
            )
         )
      )
      :effect (and
         (Holding ?block1)
         (TopClear ?block2)
         (not
            (On ?block1 ?block2)
         )
      )
   )
   (:action pick-up-from-ground
      :parameters (?block1 - block)
      :precondition (and
         (OnGround ?block1)
         (TopClear ?block1)
         (forall (?block2 - block)
            (not
               (Holding ?block2)
            )
         )
      )
      :effect (and
         (Holding ?block1)
         (not
            (OnGround ?block1)
         )
      )
   )
   (:action put-down-on-block
      :parameters (?block1 - block ?block2 - block)
      :precondition (and
         (Holding ?block1)
         (TopClear ?block2)
      )
      :effect (and
         (On ?block1 ?block2)
         (not
            (TopClear ?block2)
         )
         (not
            (Holding ?block1)
         )
      )
   )
   (:action put-down-on-ground
      :parameters (?block1 - block)
      :precondition (and
         (Holding ?block1)
      )
      :effect (and
         (OnGround ?block1)
         (not
            (Holding ?block1)
         )
      )
   )


)

; problem
(define (problem blocksworld_problem)
   (:domain blocksworld_domain)
   (:objects
      a - block
      b - block
      c - block
   )
   (:init
      (On c b)
      (OnGround a)
      (OnGround b)
      (TopClear a)
      (TopClear c)
   )
   (:goal (and
      (On a b)
      (On b c)
      (OnGround c)
   ))
)

; plan
1. (pick-up-from-block c b)
   deleted: (on c b)
   added: (holding c) (topclear b)
   goals met: 0 of 3
2. (put-down-on-ground c)
   deleted: (holding c)
   added: (onground c)
   goals met: 1 of 3
3. (pick-up-from-ground b)
   deleted: (onground b)
   added: (holding b)
   goals met: 1 of 3
4. (put-down-on-block b c)
   deleted: (topclear c) (holding b)
   added: (on b c)
   goals met: 2 of 3
5. (pick-up-from-ground a)
   deleted: (onground a)
   added: (holding a)
   goals met: 2 of 3
6. (put-down-on-block a b)
   deleted: (topclear b) (holding a)
   added: (on a b)
   goals met: 3 of 3
